app/controllers/articles_controller.rb

    def index
    if params[:_method].present?
      #@articles = current_user.articles
      @articles = current_user.articles.paginate(:page => params[:page], :per_page => 3)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT 3 OFFSET 0  [["user_id", "1"]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", "1"]]

  def create
    @article = current_user.articles.new(article_params)
    #@article = Article.new(article_params)
    #@article.user_id = current_user.id
    @article.save
    # redirect_to articles_path
    #@articles = Article.all
     @articles = Article.paginate(:page => params[:page], :per_page => 3)
---
INSERT INTO "articles" ("title", "text", "post_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "3"], ["text", "ACx"], ["post_type", "Friends"], ["user_id", "1"], ["created_at", "2016-07-02 07:08:20.461780"], ["updated_at", "2016-07-02 07:08:20.461780"]]
SELECT  "articles".* FROM "articles" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def update
      @article = Article.find(params[:id])

    if @article.update(article_params)
      #redirect_to articles_path
      #@articles = Article.all
      @articles = Article.paginate(:page => params[:page], :per_page => 3)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "post_type" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Test"], ["text", "test 1"], ["post_type", "Friends"], ["updated_at", "2016-07-07 06:38:37.445143"], ["id", 2]]
SELECT "articles".* FROM "articles"